{{--                      Представление списка

    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    |     Аттрибуты      | По умолчанию |            Комментарий            |
    |____________________|______________|___________________________________|
    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    | label              | Нет          | Тествое наименование поля         |
    | items              | []           | Массив элементов                  |
    | info               | Нет          | Комментарий                       |
    |____________________|______________|___________________________________|

--}}

<div class="list-adder-box">
    <span class="label-text">{{ $label }}</span>
    <span class="info">{{ $info ?? '' }}</span>

    <ul class="item-list">
        @foreach ($items ?? [] as $item)
            <li>
                @if (isset($link))
                    <a href="{{ $item }}">{{ $item }}</a>
                @else
                    <span>{{ $item }}</span>
                @endif
            </li>
        @endforeach
    </ul>
</div>
