{{--                      Представление списка

    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    |     Аттрибуты      | По умолчанию |            Комментарий            |
    |____________________|______________|___________________________________|
    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    | label              | Нет          | Тествое наименование поля         |
    | items              | []           | Массив элементов                  |
    |____________________|______________|___________________________________|

--}}

<div class="list-adder-box">
    <span>{{ $label }}</span>
    <ul class="item-list">
        @foreach ($items ?? [] as $item)
            <li class="example-item">
                <span>{{ $item }}</span>
            </li>
        @endforeach
    </ul>
</div>
