{{--                      Ввод изображения с предпросмотром

    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    |     Аттрибуты      | По умолчанию |            Комментарий            |
    |____________________|______________|___________________________________|
    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    | preview            | Нет          | Изображение по умолчанию          |
    | name               | Нет          | Наименования поля                 |
    | form               | Нет          | Закрепляет ввод к форме           |
    |____________________|______________|___________________________________|

--}}

<x-form.default class="{{ 'change-image-box ' . $attributes['class'] }}">
    <div class="preview">
        <img src="{{ $preview }}" alt="{{ $name }}">
    </div>
    <label for="{{ $name }}" class="change-image-label">
        <span class="button blue-button">Изменить фото</span>
        <input
            type="file"
            name="{{ $name }}"
            id="{{ $name }}"
            @isset($form)
                form="{{ $form }}"
            @endisset
        >
    </label>
</x-form.default>
