{{--                      Представление изображения

    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    |     Аттрибуты      | По умолчанию |            Комментарий            |
    |____________________|______________|___________________________________|
    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    | preview            | Нет          | Изображение по умолчанию          |
    |____________________|______________|___________________________________|

--}}

<div class="{{ 'change-image-box ' . $attributes['class'] }}">
    <div class="preview">
        <img src="{{ $preview }}" alt="image">
    </div>
    @isset($button)
        <label class="change-image-label">
            <a class="button blue-button" href="{{ isset($link) ? $link : '' }}">{{ $button }}</a>
        </label>
    @endisset
</div>
