{{--                      Выбор варианта из списка

    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    |     Аттрибуты      | По умолчанию |            Комментарий            |
    |____________________|______________|___________________________________|
    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    | label              | Нет          | Тествое наименование поля         |
    | name               | Нет          | Наименования поля                 |
    | req                | False        | Обязательное ли поле              |
    | disable            | Galse        | Отключено ли поле                 |
    | form               | Нет          | Закрепляет ввод к форме           |
    |____________________|______________|___________________________________|

--}}

@isset($label)
    <label for="{{ $name }}" class="form-select-label">
        <span>{{ $label }}</span>
    @endisset

    <select
        name        ="{{ $name }}"
        id          ="{{ $name }}"

        @isset($form)   form="{{ $form }}"      @endisset

        @required(isset($req))
        @disabled(isset($disable))
    >
        {{ $slot }}
    </select>

    @isset($label)
    </label>
@endisset
