{{--                      Выбор варианта из списка

    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    |     Аттрибуты      | По умолчанию |            Комментарий            |
    |____________________|______________|___________________________________|
    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    | label              | Нет          | Тествое наименование поля         |
    | name               | Нет          | Наименования поля                 |
    | req                | False        | Обязательное ли поле              |
    | disable            | Galse        | Отключено ли поле                 |
    | form               | Нет          | Закрепляет ввод к форме           |
    | info               | Нет          | Комментарий                       |
    |____________________|______________|___________________________________|

--}}

@isset($label)
    <label @class([
        'form-select-label',
        'req' => isset($req),
        ])
        for="{{ $name }}"
    >
        <span class="label-text">{{ $label }}</span>
    @endisset

    <span class="info">{{ $info ?? '' }}</span>

    <select
        name        ="{{ $name }}"
        id          ="{{ $name }}"

        @isset($form)   form="{{ $form }}"      @endisset

        @required(isset($req))
        @disabled(isset($disable))
    >
        {{ $slot }}
    </select>

    @isset($label)
    </label>
@endisset
