{{--                      Представление текстового поля

    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    |     Аттрибуты      | По умолчанию |            Комментарий            |
    |____________________|______________|___________________________________|
    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    | label              | Нет          | Наименование поля                 |
    | value              | Нет          | Значение поля                     |
    |____________________|______________|___________________________________|

--}}

@isset($label)
    <label class="form-input-label">
        <span>{{ $label }}</span>
    @endisset

    <textarea
        @disabled(true)
    >{{ $value }}</textarea>

    @isset($label)
    </label>
@endisset
