{{--                      Текстовый ввод

    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    |     Аттрибуты      | По умолчанию |            Комментарий            |
    |____________________|______________|___________________________________|
    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    | label              | Нет          | Тествое наименование поля         |
    | name               | Нет          | Наименования поля                 |
    | ph                 | Нет          | Подсказка                         |
    | req                | False        | Обязательное ли поле              |
    | disable            | Galse        | Отключено ли поле                 |
    |____________________|______________|___________________________________|

--}}

@isset($label)
    <label for="{{ $name }}" class="form-input-label">
        <span>{{ $label }}</span>
    @endisset

    <textarea
        name        ="{{ $name }}"
        id          ="{{ $name }}"
        placeholder ="{{ isset($ph) ? $ph : '' }}"

        @required(isset($req))
        @disabled(isset($disable))
    ></textarea>

    @isset($label)
    </label>
@endisset
