{{--                      Текстовый ввод

    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    |     Аттрибуты      | По умолчанию |            Комментарий            |
    |____________________|______________|___________________________________|
    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    | label              | Нет          | Тествое наименование поля         |
    | name               | Нет          | Наименования поля                 |
    | ph                 | Нет          | Подсказка                         |
    | req                | False        | Обязательное ли поле              |
    | disable            | Galse        | Отключено ли поле                 |
    | info               | Нет          | Комментарий                       |
    |____________________|______________|___________________________________|

--}}

@isset($label)
    <label @class([
            'form-input-label',
            'req' => isset($req),
        ])
        for="{{ $name }}"
    >
        <span class="label-text">{{ $label }}</span>
    @endisset

    <span class="info">{{ $info ?? '' }}</span>

    <textarea
        name        ="{{ $name }}"
        id          ="{{ $name }}"
        placeholder ="{{ isset($ph) ? $ph : '' }}"

        @required(isset($req))
        @disabled(isset($disable))
    ></textarea>

    @isset($label)
    </label>
@endisset
