{{--                      Текстовый ввод

    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    |     Аттрибуты      | По умолчанию |            Комментарий            |
    |____________________|______________|___________________________________|
    |‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾|‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾|
    | label              | Нет          | Тествое наименование поля         |
    | name               | Нет          | Наименования поля                 |
    | ph                 | Нет          | Подсказка                         |
    | req                | False        | Обязательное ли поле              |
    | disable            | Galse        | Отключено ли поле                 |
    | form               | Нет          | Закрепляет ввод к форме           |
    |____________________|______________|___________________________________|

--}}

@isset($label)
    <label for="{{ $name }}" class="form-input-label">
        <span>{{ $label }}</span>
    @endisset

    <input
        type        ="{{ isset($type) ? $type : 'text' }}"
        name        ="{{ $name }}"
        id          ="{{ $name }}"

        @isset($form)   form="{{ $form }}"      @endisset
        @isset($ph)     placeholder="{{ $ph }}" @endisset

        @required(isset($req))
        @disabled(isset($disable))
    >

    @isset($label)
    </label>
@endisset
